Revit 2027 API
FabricArea.TagViewId Property
 The element of the view in which to tag new members of this element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TagViewId { get; set; }
Public Property TagViewId As ElementId
	Get
	Set
public:
property ElementId^ TagViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TagViewId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: tagViewId is not a valid view for tagging the FabricArea or FabricSheets.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace